In [34]:
import pandas as pd
data_2016=pd.read_csv('BRP_datas\\BRP_common_user_book\common_user_book_19_1VS2.csv')
data_2017=pd.read_csv('BRP_datas\\BRP_common_user_book\common_user_book_19_2VS1.csv')

In [35]:
data_2016.head()

   user_id  book_id  year  month  xjcs
0       50       78  2019      1     0
1       50       69  2019      1     0
2       15       53  2019      1     0
3       24       79  2019      1     0
4       29       58  2019      1     0

In [36]:
data_2016.shape

(88, 5)

In [37]:
len(set(list(data_2016.user_id)))

66

In [38]:
data_2017.head()

   user_id  book_id  year  month  xjcs
0       37       40  2019      2     0
1       37       10  2019      2     0
2       60       28  2019      2     0
3       58       60  2019      2     1
4       49       85  2019      2     1

In [39]:
len(set(list(data_2017.user_id)))

66

In [40]:
def compute_score(borrow_book_df):
    borrow_book_df['jycs']=pd.Series([1]*borrow_book_df.shape[0])
    borrow_book_df['score']=borrow_book_df[['jycs','xjcs']].apply(lambda x:x.sum(),axis=1)
    user_book_sum=borrow_book_df[['user_id','book_id','score','month']].groupby(['user_id','book_id','month']).sum().reset_index() # 某个人借某本书的次数
    user_borrow_all=borrow_book_df[['user_id','book_id','score']].groupby('user_id').sum().reset_index()  # 某个人借书的总次数
    dictionaty=dict()
    for row,val in user_borrow_all.iterrows():
        dictionaty[val['user_id']]=val['score']
    
    user_book_sum['all_borrow']=user_book_sum['user_id'].apply(lambda x:dictionaty[x])
    user_book_sum['final_score']=user_book_sum['score']/user_book_sum['all_borrow']
    user_book_score_time=user_book_sum[['user_id','book_id','final_score','month']]
    return user_book_score_time

In [41]:
user_book_score_time_2016=compute_score(data_2016)
user_book_score_time_2017=compute_score(data_2017)

In [42]:
user_book_score_time_2016.head()

   user_id  book_id  final_score  month
0        0       47          1.0      1
1        1       33          1.0      1
2        2       18          1.0      1
3        3        6          1.0      1
4        4       51          1.0      1

In [43]:
user_book_score_time_2017.head()

   user_id  book_id  final_score  month
0        0       47          1.0      2
1        1       33          1.0      2
2        2       18          1.0      2
3        3        6          1.0      2
4        4       51          1.0      2

In [44]:
user_book_score_time_2016.to_csv('user_book_score_time\\user_book_score_time_19_1VS2.csv',index=False)
user_book_score_time_2017.to_csv('user_book_score_time\\user_book_score_time_19_2VS1.csv',index=False)